# GetPartMakerMethodToDivideVolumeFW Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartUtils..::..GetPartMakerMethodToDivideVolumeFW Method
PartUtils Class See Also
---
Obtains the object allowing access to the divided volume properties of the PartMaker.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static PartMakerMethodToDivideVolumes GetPartMakerMethodToDivideVolumeFW(
	PartMaker partMaker
)
```

Visual Basic
---
```text
Public Shared Function GetPartMakerMethodToDivideVolumeFW ( _
	partMaker As PartMaker _
) As PartMakerMethodToDivideVolumes
```

Visual C++
---
```text
public:
static PartMakerMethodToDivideVolumes^ GetPartMakerMethodToDivideVolumeFW(
	PartMaker^ partMaker
)
```

# ### Parameters
partMaker
    Type: Autodesk.Revit.DB..::..PartMaker The PartMaker.
# ### Return Value
The object handle. Returns nullNothingnullptra null reference (Nothing in Visual Basic) if the PartMaker does not represent divided volumes.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PartUtils Class
Autodesk.Revit.DB Namespace